asciiart-load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: "Warm up the application"
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up load"
    - duration: 300
      rampTo: 50
      name: "Sustained load"
  defaults:
    headers:
      Content-Type: "application/json"
scenarios:
  - name: Get v1 prices
    flow:
      - get:
          url: "/v1/prices/0x82aF49447D8a07e3bd95BD0d56f35241523fBab1/0xaf88d065e77c8cC2239327C5EDb3A432268e5831"
  - name: Get v1 batch-prices
    flow:
      - post:
          url: "/v1/batch-prices"
          json: 
            - base_asset: "0x82aF49447D8a07e3bd95BD0d56f35241523fBab1"
              quote_asset: "0xaf88d065e77c8cC2239327C5EDb3A432268e5831"